Autodesk.Revit.DB.MaterialAspect
A list of all material aspects that a material can store PropertySetElements for.
Since:
2012

Autodesk.Revit.DB.MaterialAspect.Thermal
Thermal

Autodesk.Revit.DB.MaterialAspect.Structural
Structural